{
  "projets": [
    {
      "nom": "cloth2you",
      "technologie": "React, Node, Express, PostgreSQL, TailwindCSS",
      "description": "Le projet de fin d'année du troisième semestre de BUT Informatique avait comme consigne le développement d'un site web d'enchères. Mon équipe et moi avons donc décidé de développer 'cloth2you', un site web permettant de vendre et d'acheter des vêtements faits-main. Cette plateforme a pour vocation d'être facilement utilisable, et se propose comme une alternative aux sites de revente de vêtements déjà existants.",
      "date": "2023",
      "image": "cloth2you.png",
      "type": "Formation",
      "color": "#424247",
      "nbImages": 2
    },
    {
      "nom": "One Last Hope",
      "technologie": "Python, Pygame",
      "description": "La Gamejam de 3ème année de BUT Informatique avait comme sujet les robots et la gravité. Mon équipe et moi avons donc décidé de développer 'One Last Hope', un jeu de plateforme dans lequel le joueur incarne un robot qui doit sauver sa planète. Ce jeu a été développé en Python, avec la bibliothèque Pygame. Avec plusieurs artefacts à récuperer le long des niveaux et une difficulté grandissante le long des niveaux, finir le jeu est réserver aux plus expérimentés. De plus, l'histoire possède des fins alternatives pour prolonger l'expérience.",
      "date": "2023",
      "image": "one-last-hope.png",
      "type": "Formation",
      "color": "#2190D7",
      "nbImages": 3
    },
    {
      "nom": "Tour of Heroes",
      "technologie": "Angular",
      "description": "Dans le cadre d’un module de ma formation, j’avais pour mission de créer un site web en utilisant la technologie Angular. Ce site web, intitulé 'Tour of Heroes', permet de faire combattre des héros. Ces héros sont définis depuis des fiches permettant de modifier leurs statistiques, et de les sauvegarder dans une base de données Firebase.",
      "date": "2023",
      "image": "tour-of-heroes.png",
      "type": "Formation",
      "video": "tour-of-heroes.mp4",
      "nbImages": 0,
      "color": "#FF4242"
    },
    {
      "nom": "Players",
      "technologie": "React, Node, MySQL",
      "description": "Players est un projet personnel en cours de développement. Étant une continuation d'un projet d'API Node, il permet de lister des joueurs de basket-ball, et de les associer à des équipes. Ce projet est développé en React, et est en cours de développement.",
      "date": "2024",
      "image": "players.png",
      "type": "Personnel",
      "nbImages": 1,
      "color": "#FFB13B"
    },
    {
      "nom": "Amadis",
      "technologie": "Java, JavaFX",
      "description": "En fin de première année de BUT Informatique, j'ai eu l'occasion de travailler sur un projet de développement d'un site web de gestion de salle de spectacle, plus particulièrement de salles de théatre. Cette application non-communicante avait comme objectif de relier les troupes de théatre aux salles de spectacle, et de permettre aux troupes de gérer leurs représentations. Ce projet a été développé en Java, avec la bibliothèque JavaFX, et a été réalisé en groupe de 6 personnes.",
      "date": "2022",
      "image": "amadis.png",
      "type": "Formation",
      "color": "#d20b25"
    },
    {
      "nom": "Demineur",
      "technologie": "Flutter, Firebase",
      "description": "Le démineur est le premier jeu que j'ai réalisé en utilisant la technologie Flutter. Ce jeu est une version simplifiée du démineur classique, avec plusieurs niveaux de difficulté. En relation avec une base de données Firebase, il permet de se connecter, de sauvegarder les meilleurs scores, et de constater son évolution.",
      "date": "2024",
      "image": "demineur.png",
      "type": "Formation"
    }
  ]
}
